[
  {
    "author": "Herman Melville",
    "book": "Moby-Dick",
    "year": 1851,
    "firstline": "Call me Ishmael."
  },
  {
    "author": "Jane Austen",
    "book": "Pride and Prejudice",
    "year": 1813,
    "firstline": "It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife."
  },
  {
    "author": "Thomas Pynchon",
    "book": "Gravity's Rainbow",
    "year": 1973,
    "firstline": "A screaming comes across the sky."
  },
  {
    "author": "Gabriel García Márquez",
    "book": "One Hundred Years of Solitude",
    "year": 1967,
    "firstline": "Many years later, as he faced the firing squad, Colonel Aureliano Buendí­a was to remember that distant afternoon when his father took him to discover ice."
  },
  {
    "author": "Vladimir Nabokov",
    "book": "Lolita",
    "year": 1955,
    "firstline": "Lolita, light of my life, fire of my loins."
  },
  {
    "author": "Leo Tolstoy",
    "book": "Anna Karenina",
    "year": 1877,
    "firstline": "Happy families are all alike; every unhappy family is unhappy in its own way."
  },
  {
    "author": "James Joyce",
    "book": "Finnegans Wake",
    "year": 1939,
    "firstline": "riverrun, past Eve and Adam's, from swerve of shore to bend of bay, brings us by a commodius vicus of recirculation back to Howth Castle and Environs."
  },
  {
    "author": "George Orwell",
    "book": "1984",
    "year": 1949,
    "firstline": "It was a bright cold day in April, and the clocks were striking thirteen."
  },
  {
    "author": "Charles Dickens",
    "book": "A Tale of Two Cities",
    "year": 1859,
    "firstline": "It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of Light, it was the season of Darkness, it was the spring of hope, it was the winter of despair."
  },
  {
    "author": "Ralph Ellison",
    "book": "Invisible Man",
    "year": 1952,
    "firstline": "I am an invisible man."
  },
  {
    "author": "Mark Twain",
    "book": "The Adventures of Huckleberry Finn",
    "year": 1885,
    "firstline": "You don't know about me without you have read a book by the name of The Adventures of Tom Sawyer; but that ain't no matter."
  },
  {
    "author": "Franz Kafka",
    "book": "The Trial",
    "year": 1925,
    "firstline": "Someone must have slandered Josef K., for one morning, without having done anything truly wrong, he was arrested."
  },
  {
    "author": "J. D. Salinger",
    "book": "The Catcher in the Rye",
    "year": 1951,
    "firstline": "If you really want to hear about it, the first thing you'll probably want to know is where I was born, and what my lousy childhood was like, and how my parents were occupied and all before they had me, and all that David Copperfield kind of crap, but I don't feel like going into it, if you want to know the truth."
  },
  {
    "author": "Charles Dickens",
    "book": "David Copperfield",
    "year": 1850,
    "firstline": "Whether I shall turn out to be the hero of my own life, or whether that station will be held by anybody else, these pages must show."
  },
  {
    "author": "James Joyce",
    "book": "Ulysses",
    "year": 1922,
    "firstline": "Stately, plump Buck Mulligan came from the stairhead, bearing a bowl of lather on which a mirror and a razor lay crossed."
  },
  {
    "author": "Miguel de Cervantes",
    "book": "Don Quixote",
    "year": 1605,
    "firstline": "Somewhere in la Mancha, in a place whose name I do not care to remember, a gentleman lived not long ago, one of those who has a lance and ancient shield on a shelf and keeps a skinny nag and a greyhound for racing."
  },
  {
    "author": "Albert Camus",
    "book": "The Stranger",
    "year": 1942,
    "firstline": "Mother died today. Or yesterday maybe, I don't know."
  },
  {
    "author": "Fyodor Dostoyevsky",
    "book": "Notes from Underground",
    "year": 1864,
    "firstline": "I am a sick man... I am a spiteful man."
  },
  {
    "author": "Kurt Vonnegut",
    "book": "Slaughterhouse-Five",
    "year": 1969,
    "firstline": "All this happened, more or less."
  },
  {
    "author": "Ernest Hemingway",
    "book": "The Old Man and the Sea",
    "year": 1952,
    "firstline": "He was an old man who fished alone in a skiff in the Gulf Stream and he had gone eighty-four days now without taking a fish."
  },
  {
    "author": "Ray Bradbury",
    "book": "Fahrenheit 451",
    "year": 1953,
    "firstline": "It was a pleasure to burn."
  },
  {
    "author": "Joseph Heller",
    "book": "Catch-22",
    "year": 1961,
    "firstline": "It was love at first sight."
  },
  {
    "author": "F. Scott Fitzgerald",
    "book": "The Great Gatsby",
    "year": 1925,
    "firstline": "In my younger and more vulnerable years my father gave me some advice that I've been turning over in my mind ever since."
  },
  {
    "author": "Neil Gaiman",
    "book": "Anansi Boys",
    "year": null,
    "firstline": "It begins, as most things begin, with a song."
  },
  {
    "author": "Kurt Vonnegut",
    "book": "Cat's Cradle",
    "year": null,
    "firstline": "Nothing in this book is true."
  },
  {
    "author": "Franz Kafka",
    "book": "The Metamorphosis",
    "year": null,
    "firstline": "One morning, as Gregor Samsa was waking up from anxious dreams, he discovered that in his bed he had been changed into a monstrous verminous bug."
  },
  {
    "author": "J. R. R. Tolkien",
    "book": "The Silmarillion",
    "year": null,
    "firstline": "There was Eru, the One, who in Arda is called Ilúvatar; and he made first the Ainur, the Holy Ones, that were the offspring of his thought, and they were with him before aught else was made."
  },
  {
    "author": "Arthur Conan Doyle",
    "book": "The Hound of the Baskervilles",
    "year": null,
    "firstline": "Mr. Sherlock Holmes, who was usually very late in the mornings, save upon those not infrequent occasions when he stayed up all night, was seated at the breakfast table."
  },
  {
    "author": "J. R. R. Tolkien",
    "book": "The Hobbit",
    "year": null,
    "firstline": "In a hole in the ground there lived a hobbit."
  },
  {
    "author": "Haruki Murakami",
    "book": "Norwegian Wood",
    "year": null,
    "firstline": "I was 37 then, strapped in my seat as the huge 747 plunged through dense cloud cover on approach to Hamburg airport."
  },
  {
    "author": "J. K. Rowling",
    "book": "Harry Potter and the Philosopher's Stone",
    "year": null,
    "firstline": "Mr. and Mrs. Dursley, of number four, Privet Drive, were proud to say that they were perfectly normal, thank you very much."
  },
  {
    "author": "Harper Lee",
    "book": "To Kill a Mockingbird",
    "year": null,
    "firstline": "When he was nearly thirteen, my brother Jem got his arm badly broken at the elbow."
  },
  {
    "author": "Lewis Carrol",
    "book": "Alice's Adventures in Wonderland",
    "year": null,
    "firstline": "Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do: once or twice she had peeped into the book her sister was reading, but it had no pictures or conversations in it, 'and what is the use of a book,' thought Alice, 'without pictures or conversation?'"
  },
  {
    "author": "J. R. R. Tolkien",
    "book": "The Lord of the Rings",
    "year": null,
    "firstline": "When Mr. Bilbo Baggins of Bag End announced that he would shortly be celebrating his eleventy-first birthday with a party of special magnificence, there was much talk and excitement in Hobbiton."
  },
  {
    "author": "Daniel Keyes",
    "book": "Flowers for Algernon",
    "year": null,
    "firstline": "Dr Strauss says I shoud rite down what I think and remembir and evrey thing that happins to me from now on."
  },
  {
    "author": "Jack London",
    "book": "The Call of the Wild",
    "year": null,
    "firstline": "Buck did not read the newspapers, or he would have known that trouble was brewing, not alone for himself, but for every tidewater dog, string of muscle and with warm long hair from Pugent Sound to San Diago."
  },
  {
    "author": "Gabriel García Márquez",
    "book": "Love in the Time of Cholera",
    "year": null,
    "firstline": "It was inevitable: the scent of bitter almonds always reminded him of the fate of unrequited love."
  },
  {
    "author": "Nikos Kazantzakis",
    "book": "Zorba the Greek",
    "year": null,
    "firstline": "I first met him in Piraeus."
  },
  {
    "author": "Hunter S. Thompson",
    "book": "Fear and Loathing in Las Vegas",
    "year": null,
    "firstline": "We were somewhere around Barstow on the edge of the desert when the drugs began to take hold."
  },
  {
    "author": "Anthony Burgess",
    "book": "A Clockwork Orange",
    "year": null,
    "firstline": "'What's it going to be then, eh?'"
  },
  {
    "author": "Mikhail Bulgakov",
    "book": "The Master and Margarita",
    "year": null,
    "firstline": "One hot spring evening, just as the sun was going down, two men appeared at Patriarch's Ponds."
  },
  {
    "author": "Salman Rushdie",
    "book": "The Moor's Last Sigh",
    "year": null,
    "firstline": "I have lost count of the days that have passed since I fled the horrors of Vasco Miranda's mad fortress in the Andalusian mountain-village of Benengeli; ran from death under cover of darkness and left a message nailed to the door."
  },
  {
    "author": "George Orwell",
    "book": "Animal Farm",
    "year": null,
    "firstline": "Mr. Jones, of the Manor Farm, had locked the hen-houses for the night, but was too drunk to remember to shut the popholes."
  },
  {
    "author": "William Golding",
    "book": "Lord of the Flies",
    "year": null,
    "firstline": "The boy with fair hair lowered himself down the last few feet of rock and began to pick his way toward the lagoon."
  },
  {
    "author": "Chuck Palahniuk",
    "book": "Fight Club",
    "year": null,
    "firstline": "Tyler gets me a job as a waiter, after that Tyler's pushing a gun in my mouth and saying, the first step to eternal life is you have to die."
  },
  {
    "author": "Charles Bukowski",
    "book": "Post Office",
    "year": null,
    "firstline": "It began as a mistake."
  },
  {
    "author": "Ken Kesey",
    "book": "One Flew Over the Cuckoo's Nest",
    "year": 1962,
    "firstline": "They're out there."
  },
  {
    "author": "Aldous Huxley",
    "book": "Brave New World",
    "year": null,
    "firstline": "A squat grey building of only thirty-four stories."
  },
  {
    "author": "Douglas Adams",
    "book": "The Hitchhiker's Guide to the Galaxy",
    "year": null,
    "firstline": "Far out in the uncharted backwaters of the unfashionable end of the western spiral arm of the Galaxy lies a small, unregarded yellow sun."
  },
  {
    "author": "Umberto Eco",
    "book": "The Name of The Rose",
    "year": null,
    "firstline": "In the beginning was the Word, and the Word was with God, and the Word was God."
  },
  {
    "author": "Terry Pratchett",
    "book": "Reaper Man",
    "year": null,
    "firstline": "The Morris dance is common to all inhabited worlds in the multiverse."
  },
  {
    "author": "Cormac McCarthy",
    "book": "The Road",
    "year": null,
    "firstline": "When he woke in the woods in the dark and the cold of the night he'd reach out to touch the child sleeping beside him."
  },
  {
    "author": "Lewis Carrol",
    "book": "Through the Looking Glass",
    "year": null,
    "firstline": "One thing was certain, that the white kitten had had nothing to do with it: -- it was the black kitten's fault entirely."
  },
  {
    "author": "Irvine Welsh",
    "book": "Trainspotting",
    "year": null,
    "firstline": "The sweat wis lashing oafay Sick Boy; he wis trembling."
  },
  {
    "author": "Günter Grass",
    "book": "The Tin Drum",
    "year": null,
    "firstline": "Granted: I AM an inmate of a mental hospital; my keeper is watching me, he never lets me out of his sight; there's a peep-hole in the door, and my keeper's eye is the shade of brown that can never see through a blue-eyed type like me."
  },
  {
    "author": "Nathaniel Hawthorne",
    "book": "The Scarlet Letter",
    "year": null,
    "firstline": "A throng of bearded men, in sad-colored garments, and gray, steeple-crowed hats, intermixed with women, some wearing hoods and others bareheaded, was assembled in front of a wooden edifice, the door of which was heavily timbered with oak, and studded with spikes."
  },
  {
    "author": "Khaled Hosseini",
    "book": "The Kite Runner",
    "year": null,
    "firstline": "I became what I am today at the age of twelve, on a frigid overcast day in the winter of 1975."
  },
  {
    "author": "Roald Dahl",
    "book": "The BFG",
    "year": null,
    "firstline": "Sophie couldn't sleep."
  },
  {
    "author": "H. G. Wells",
    "book": "The War of the Worlds",
    "year": null,
    "firstline": "No one would have believed, in the last years of the nineteenth century, that this world was being watched keenly and closely by intelligences greater than man's and yet as mortal as his own; that as men busied themselves about their various concerns they were being scrutinized and studied, perhaps almost as narrowly as a man with a microscope might scrutinize the transient creatures that swarm and multiply in a drop of water."
  }
]
